---
kind: method
id: M:Autodesk.Revit.DB.ReferenceIntersector.GetFilter
zh: 射线、射线相交
source: html/614c9ce9-9918-b551-a4f1-552030cdb0c9.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.GetFilter Method

**中文**: 射线、射线相交

Gets the ElementFilter used in intersection testing.

## Syntax (C#)
```csharp
public ElementFilter GetFilter()
```

## Returns
The ElementFilter, or Nothing nullptr a null reference ( Nothing in Visual Basic) if no filter is set.